feaser/openblt/Target/Source/ARMCM3_EFM32/flash.c
/****************************************************************************************
|  Description: bootloader flash driver source file
|    File Name: flash.c
|
|----------------------------------------------------------------------------------------
|                          C O P Y R I G H T
|----------------------------------------------------------------------------------------
|   Copyright (c) 2012  by Feaser    http://www.feaser.com    All rights reserved
|
|----------------------------------------------------------------------------------------
|                            L I C E N S E
|----------------------------------------------------------------------------------------
| This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
| modify it under the terms of the GNU General Public License as published by the Free
| Software Foundation, either version 3 of the License, or (at your option) any later
| version.
|
| OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
| without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
| PURPOSE. See the GNU General Public License for more details.
|
| You should have received a copy of the GNU General Public License along with OpenBLT.
| If not, see <http://www.gnu.org/licenses/>.
|
| A special exception to the GPL is included to allow you to distribute a combined work 
| that includes OpenBLT without being obliged to provide the source code for any 
| proprietary components. The exception text is included at the bottom of the license
| file <license.html>.
| 
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "efm32_msc.h"                           /* MSC driver from EFM32 library      */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
#define FLASH_INVALID_SECTOR            (0xff)
#define FLASH_INVALID_ADDRESS           (0xffffffff)
#define FLASH_WRITE_BLOCK_SIZE          (512)
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
#define FLASH_VECTOR_TABLE_CS_OFFSET    (0x0B8)


/****************************************************************************************
* Type definitions
****************************************************************************************/
/* flash sector descriptor type */
typedef struct 
{
  blt_addr   sector_start;                       /* sector start address               */
  blt_int32u sector_size;                        /* sector size in bytes               */
  blt_int8u  sector_num;                         /* sector number                      */
} tFlashSector;                                  /* flash sector description           */

/* programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a flash block
 * manager is implemented in this driver. this flash block manager depends on this
 * flash block info structure. It holds the base address of the flash block and the
 * data that should be programmed into the flash block. The .base_addr must be a multiple 
 * of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool   FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool   FlashAddToBlock(tFlashBlockInfo *block, blt_addr address, 
                                  blt_int8u *data, blt_int16u len);
static blt_bool   FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool   FlashEraseSectors(blt_int8u first_sector, blt_int8u last_sector);
static blt_int8u  FlashGetSector(blt_addr address);
static blt_addr   FlashGetSectorBaseAddr(blt_int8u sector);
static blt_addr   FlashGetSectorSize(blt_int8u sector);
static blt_int32u FlashCalcPageSize(void);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/* The current flash layout does not reflect the minimum sector size of the physical
 * flash (1 - 2kb), because this would make the table quit long and a waste of ROM. The
 * minimum sector size is only really needed when erasing the flash. This can still be
 * done in combination with macro FLASH_ERASE_BLOCK_SIZE.
 */
static const tFlashSector flashLayout[] =
{
#if defined(__ICCARM__)
/* the IAR compiler generates compact code and therefore the space occupied by the
 * bootloader is less.
 */
  /* { 0x00000000, 0x02000,  0},           flash sector  0 - reserved for bootloader   */
  { 0x00002000, 0x02000,  1},           /* flash sector  1 - 8kb                       */
  { 0x00004000, 0x02000,  2},           /* flash sector  2 - 8kb                       */
  { 0x00006000, 0x02000,  3},           /* flash sector  3 - 8kb                       */
#else
  /* { 0x00000000, 0x02000,  0},           flash sector  0 - reserved for bootloader   */
  /* { 0x00002000, 0x02000,  1},           flash sector  1 - reserved for bootloader   */
  { 0x00004000, 0x02000,  2},           /* flash sector  2 - 8kb                       */
  { 0x00006000, 0x02000,  3},           /* flash sector  3 - 8kb                       */
#endif
#if (BOOT_NVM_SIZE_KB > 32)
  { 0x00008000, 0x02000,  4},           /* flash sector  4 - 8kb                       */
  { 0x0000A000, 0x02000,  5},           /* flash sector  5 - 8kb                       */
  { 0x0000C000, 0x02000,  6},           /* flash sector  6 - 8kb                       */
  { 0x0000E000, 0x02000,  7},           /* flash sector  7 - 8kb                       */
#endif
#if (BOOT_NVM_SIZE_KB > 64)
  { 0x00010000, 0x02000,  8},           /* flash sector  8 - 8kb                       */
  { 0x00012000, 0x02000,  9},           /* flash sector  9 - 8kb                       */
  { 0x00014000, 0x02000, 10},           /* flash sector 10 - 8kb                       */
  { 0x00016000, 0x02000, 11},           /* flash sector 11 - 8kb                       */
  { 0x00018000, 0x02000, 12},           /* flash sector 12 - 8kb                       */
  { 0x0001A000, 0x02000, 13},           /* flash sector 13 - 8kb                       */
  { 0x0001C000, 0x02000, 14},           /* flash sector 14 - 8kb                       */
  { 0x0001E000, 0x02000, 15},           /* flash sector 15 - 8kb                       */
#endif
#if (BOOT_NVM_SIZE_KB > 128)
  { 0x00020000, 0x08000, 16},           /* flash sector 16 - 32kb                      */
  { 0x00028000, 0x08000, 17},           /* flash sector 17 - 32kb                      */
  { 0x00030000, 0x08000, 18},           /* flash sector 18 - 32kb                      */
  { 0x00038000, 0x08000, 19},           /* flash sector 19 - 32kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x00040000, 0x08000, 20},           /* flash sector 20 - 32kb                      */
  { 0x00048000, 0x08000, 21},           /* flash sector 21 - 32kb                      */
  { 0x00050000, 0x08000, 22},           /* flash sector 22 - 32kb                      */
  { 0x00058000, 0x08000, 23},           /* flash sector 23 - 32kb                      */
  { 0x00060000, 0x08000, 24},           /* flash sector 24 - 32kb                      */
  { 0x00068000, 0x08000, 25},           /* flash sector 25 - 32kb                      */
  { 0x00070000, 0x08000, 26},           /* flash sector 26 - 32kb                      */
  { 0x00078000, 0x08000, 27},           /* flash sector 27 - 32kb                      */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
#error "BOOT_NVM_SIZE_KB > 512 is currently not supported."
#endif
};


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/* The smallest amount of flash that can be programmed is FLASH_WRITE_BLOCK_SIZE. A flash
 * block manager is implemented in this driver and stores info in this variable. Whenever
 * new data should be flashed, it is first added to a RAM buffer, which is part of this
 * variable. Whenever the RAM buffer, which has the size of a flash block, is full or 
 * data needs to be written to a different block, the contents of the RAM buffer are 
 * programmed to flash. The flash block manager requires some software overhead, yet
 * results is faster flash programming because data is first harvested, ideally until
 * there is enough to program an entire flash block, before the flash device is actually
 * operated on.
 */
static tFlashBlockInfo blockInfo;

/* The first block of the user program holds the vector table, which on the STM32 is
 * also the where the checksum is written to. Is it likely that the vector table is
 * first flashed and then, at the end of the programming sequence, the checksum. This
 * means that this flash block need to be written to twice. Normally this is not a 
 * problem with flash memory, as long as you write the same values to those bytes that
 * are not supposed to be changed and the locations where you do write to are still in
 * the erased 0xFF state. Unfortunately, writing twice to flash this way, does not work
 * reliably on all micros. This is why we need to have an extra block, the bootblock,
 * placed under the management of the block manager. This way is it possible to implement
 * functionality so that the bootblock is only written to once at the end of the 
 * programming sequency.
 */
static tFlashBlockInfo bootBlockInfo;


/****************************************************************************************
** NAME:           FlashInit
** PARAMETER:      none
** RETURN VALUE:   none
** DESCRIPTION:    Initializes the flash driver. 
**
****************************************************************************************/
void FlashInit(void)
{
  /* enable the flash controller for writing */
  MSC_Init();
  /* init the flash block info structs by setting the address to an invalid address */
  blockInfo.base_addr = FLASH_INVALID_ADDRESS;
  bootBlockInfo.base_addr = FLASH_INVALID_ADDRESS;
} /*** end of FlashInit ***/


/****************************************************************************************
** NAME:           FlashWrite
** PARAMETER:      addr start address
**                 len  length in bytes
**                 data pointer to the data buffer.
** RETURN VALUE:   BLT_TRUE if successful, BLT_FALSE otherwise. 
** DESCRIPTION:    Writes the data to flash through a flash block manager. Note that this
**                 function also checks that no data is programmed outside the flash 
**                 memory region, so the bootloader can never be overwritten.
**
****************************************************************************************/
blt_bool FlashWrite(blt_addr addr, blt_int32u len, blt_int8u *data)
{
  blt_addr base_addr;

